ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263P/CONTROLSS_PWMSYNCOUTXBAR_CONTROLSS_502D2000h.xml
<module name="CONTROLSS" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="CONTROLSS_PWMSYNCOUTXBAR0_G0" acronym="CONTROLSS_PWMSYNCOUTXBAR0_G0" offset="256" width="32" description="EPWM pwmsyncout XBAR0 select.">
		<bitfield id="PWMSYNCOUTXBAR0_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM pwmsyncout XBAR0 select1:PWM[x] SYNCOUT selected0:PWM[x] SYNCOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMSYNCOUTXBAR1_G0" acronym="CONTROLSS_PWMSYNCOUTXBAR1_G0" offset="320" width="32" description="EPWM pwmsyncout XBAR1 select.">
		<bitfield id="PWMSYNCOUTXBAR1_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM pwmsyncout XBAR1 select1:PWM[x] SYNCOUT selected0:PWM[x] SYNCOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMSYNCOUTXBAR2_G0" acronym="CONTROLSS_PWMSYNCOUTXBAR2_G0" offset="384" width="32" description="EPWM pwmsyncout XBAR2 select.">
		<bitfield id="PWMSYNCOUTXBAR2_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM pwmsyncout XBAR2 select1:PWM[x] SYNCOUT selected0:PWM[x] SYNCOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMSYNCOUTXBAR3_G0" acronym="CONTROLSS_PWMSYNCOUTXBAR3_G0" offset="448" width="32" description="EPWM pwmsyncout XBAR2 select.">
		<bitfield id="PWMSYNCOUTXBAR3_G0_SEL" width="32" begin="31" end="0" resetval="0x0" description="EPWM pwmsyncout XBAR3 select1:PWM[x] SYNCOUT selected0:PWM[x] SYNCOUT is de-selected" range="31:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMSYNCOUTXBAR0_G1" acronym="CONTROLSS_PWMSYNCOUTXBAR0_G1" offset="512" width="32" description="EPWM pwmsyncout XBAR3 select.">
		<bitfield id="PWMSYNCOUTXBAR0_G1_SEL" width="16" begin="15" end="0" resetval="0x0" description="EPWM pwmsyncout XBAR0 select1:ECAP[x] SYNCOUT selected0:ECAP[x] SYNCOUT is de-selected" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMSYNCOUTXBAR1_G1" acronym="CONTROLSS_PWMSYNCOUTXBAR1_G1" offset="576" width="32" description="EPWM pwmsyncout XBAR3 select.">
		<bitfield id="PWMSYNCOUTXBAR1_G1_SEL" width="16" begin="15" end="0" resetval="0x0" description="EPWM pwmsyncout XBAR1 select1:ECAP[x] SYNCOUT selected0:ECAP[x] SYNCOUT is de-selected" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMSYNCOUTXBAR2_G1" acronym="CONTROLSS_PWMSYNCOUTXBAR2_G1" offset="640" width="32" description="EPWM pwmsyncout XBAR0 select.">
		<bitfield id="PWMSYNCOUTXBAR2_G1_SEL" width="16" begin="15" end="0" resetval="0x0" description="EPWM pwmsyncout XBAR2 select1:ECAP[x] SYNCOUT selected0:ECAP[x] SYNCOUT is de-selected" range="15:0" rwaccess="R/W"/>
	</register><register id="CONTROLSS_PWMSYNCOUTXBAR3_G1" acronym="CONTROLSS_PWMSYNCOUTXBAR3_G1" offset="704" width="32" description="EPWM pwmsyncout XBAR1 select.">
		<bitfield id="PWMSYNCOUTXBAR3_G1_SEL" width="16" begin="15" end="0" resetval="0x0" description="EPWM pwmsyncout XBAR3 select1:ECAP[x] SYNCOUT selected0:ECAP[x] SYNCOUT is de-selected" range="15:0" rwaccess="R/W"/>
	</register>
</module>